app/Http/Controllers/PropertyManager/BuildingController.php

select * from `buildings` where `buildings`.`id` = '1' limit 1
select * from `building_blocks` where `building_id` = '1'
select * from `building_inventories` where `building_id` = '1' and `block_id` is null
---
    public function building_view($panel,$building_id)
    {
        $building = Building::with('block.inventory')->findOrFail($building_id);
        $blocks = BuildingBlock::where('building_id',$building_id)->get();
        $inventories = BuildingInventory::where('building_id',$building_id)->whereNull('block_id')->get();