app/Http/Controllers/PropertyManager/EmailController.php

select * from `email_histories` where `email_histories`.`id` = '3' limit 1
---
    public function email_view($panel,$id)
    {
        $email = EmailHistory::findOrFail($id);