app/Http/Controllers/PropertyManager/IncomeController.php

select `name`, `id` from `building_income_categories`
select sum(`cost`) as aggregate from `incomes` where `category_id` = 1 and month(`date`) = '01' and year(`date`) = '2022'
select sum(`cost`) as aggregate from `incomes` where month(`date`) = '01' and year(`date`) = '2022'
---
    public function incomeSummary(Request $request,$panel)
    {
        if(isset($request->start_month)){
            $year = Carbon::parse($request->start_month)->format('Y');
        }else{
            $year = date('Y');
        }
        $months = ['January', 'February', 'March', 'April', 'May', 'June', 'July ', 'August', 'September', 'October', 'November', 'December'];
        $incomes = [];
        $categories = BuildingIncomeCategory::pluck('name','id')->toArray();
        foreach($categories as $id => $name){
            for($i = 1;$i<= 12;$i++) {
                $income = Income::where('category_id', $id)->whereMonth('date', $i)->whereYear('date',$year);
                if (isset($request->start_month) && isset($request->last_month)){
                    $income->whereBetween('date',[$request->start_month,$request->last_month]);
                }
                $income = $income->sum('cost');
                $incomes[$name][] = $income;
            }
        }
        $total = [];
        for($i = 1;$i<= 12;$i++) {
            $income = Income::whereMonth('date', $i)->whereYear('date',$year);
            if (isset($request->start_month) && isset($request->last_month)){
                $income->whereBetween('date',[$request->start_month,$request->last_month]);
            }
            $total[] = $income->sum('cost');