app/Http/Controllers/PropertyManager/InvestorController.php

    public function index()
    {
        $investor = Investor::all();
---
select * from `investors`