app/Http/Controllers/PropertyManager/InvestorController.php

    public function create()
    {
        $buildings = Helpers::building_detail();
        $categories = BuildingCategory::all();
        $sizes = BuildingSize::all();
---
select * from `building_categories`
select * from `building_sizes`

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required',
            'phone_number' => 'required|unique:users,phone_number',
            'email' => 'unique:users,email',
            'cnic' => 'unique:users,cnic',
            'total_amount' => 'required',
            'invested_amount' => 'required',
            'invested_in' => 'required',
        ]);
        if((int)$request->total_amount < (int)$request->invested_amount){
            return redirect()->back()->with($this->message('Invested Amount Cannot Be Greater Than Total Amount','danger'));
        }
        $user = new User();
        $user->username = $request->name;
        $user->email = $request->email;
        $user->phone_number = $request->phone_number;
        $user->cnic = $request->cnic;
        $user->address = $request->address;
        $user->save();
---
insert into `users` (`username`, `email`, `phone_number`, `cnic`, `address`, `updated_at`, `created_at`) values ('Jael Fowler', 'qiqowep@mailinator.com', '270', '45', 'Eos non ab elit qui', '2022-11-02 18:21:32', '2022-11-02 18:21:32')

        $investor->return_amount = $request->return_amount;
        $investor->return_date = $request->return_date;
        $investor->remaining_amount = $remaining_amount;
        $investor->save();
---
insert into `investors` (`user_id`, `invest_to`, `total_amount`, `profit`, `loss`, `investor_profit_amount`, `profit_percentage`, `return_amount`, `return_date`, `remaining_amount`, `updated_at`, `created_at`) values (23, 10, '4', '62', '97', '83', '26', '57', '1989-11-30', 0, '2022-11-02 18:21:32', '2022-11-02 18:21:32')

        $investor_history->size_id = $request->size_id;
        $investor_history->quantity = $request->quantity;
        $investor_history->profit_percentage = $request->profit_percentage;
        $investor_history->save();
---
insert into `investor_histories` (`investor_id`, `invested_amount`, `invested_in`, `category_id`, `size_id`, `quantity`, `profit_percentage`, `updated_at`, `created_at`) values (9, '4', '1', '4', '1', '945', '26', '2022-11-02 18:21:32', '2022-11-02 18:21:32')