app/Http/Controllers/PropertyManager/OfficeExpenseController.php

select * from `building_office_expenses` where `building_id` in (1, 2)
select * from `buildings` where `buildings`.`id` in (1, 2)
---
    public function index()
    {
        $building = Helpers::building_detail();
        $office_expenses = BuildingOfficeExpense::with('building')->whereIn('building_id', $building->pluck('id')->toArray())->get();