app/Helpers/Helpers.php

select * from `users` where `users`.`id` = 10 and `users`.`deleted_at` is null limit 1
---
    public static function user_admin()
    {
        $id = Auth::id();
        if (Auth::user()->roles[0]->name == 'property_admin') {
            $user = User::findOrFail($id)->id;
        } elseif (Auth::user()->roles[0]->name == 'property_manager') {
            $user = User::findOrFail($id)->property_admin_id;

select * from `building_assign_users` where `user_id` = 11
---
    public static function building_assign_user()
    {
        if (Auth::user()->hasRole('sale_person')){
            $user = Helpers::user_admin();
        } else {
            $user = Auth::id();
        }
        $building_assign_user = BuildingAssignUser::where('user_id', $user)->get();

select * from `building_employees` where `building_employees`.`user_id` in (13)
select * from `users` where `users`.`id` in (12) and `users`.`deleted_at` is null
---
    public static function sales_person()
    {
//        dd(Auth::user()->id);
        $building = Helpers ::building_detail();
        $sale_person = User::with('building_employee')
            ->whereHas('roles', function ($q) {
                $q->where('name', 'sale_person');
            })
            ->whereHas('building_employee', function ($q) use ($building) {
                $q->whereIn('building_id', $building->pluck('id')->toArray());
            })
            ->where('property_admin_id', Helpers::user_admin())->get();