app/Helpers/Helpers.php

    public static function user_permission($key)
    {
        if(Helpers::isPropertyAdmin()){
            $user_permission = \App\Models\UserSetting::where('user_id', \Illuminate\Support\Facades\Auth::id())->where('key', $key)->first()->status;
---
select * from `user_settings` where `user_id` = 1 and `key` = 'whats_app_module' limit 1