app/Http/Controllers/Property/EmployeeController.php

insert into `users` (`username`, `email`, `password`, `phone_number`, `cnic`, `property_admin_id`, `updated_at`, `created_at`) values ('Jared Lowe', 'licycen@mailinator.com', '$2y$10$0KQQul5IHABWZre6jwLUZupkqiiad7QkE6NzJ7eqvgElUAA2TYEIy', '430', '32', 10, '2022-11-03 20:03:21', '2022-11-03 20:03:21')
---
    public function store(Request $request)
    {
        $request->validate([
            'building_id' => 'required',
            'name' => 'required',
            'email' => 'required|unique:users,email',
            'cnic' => 'required|unique:users,cnic',
            'job_title' => 'required',
            'phone_number' => 'required|unique:users,phone_number'
        ]);
        if ($request->job_title == 'sale_person') {
            $request->validate([
                'sale_manager_id' => 'required',
            ]);
        }
        $employee = new User();
        $employee->username = $request->name;
        $employee->email = $request->email;
        if ($request->password == null) {
            $employee->password = Hash::make(12345678);
        } else {
            $employee->password = Hash::make($request->password);
        }
        $employee->phone_number = $request->phone_number;
        $employee->cnic = $request->cnic;
        $employee->property_admin_id = Helpers::user_admin();
        $employee->save();

insert into `building_assign_users` (`user_id`, `building_id`, `updated_at`, `created_at`) values (31, '1', '2022-11-03 20:03:21', '2022-11-03 20:03:21')
---
            $employee_detail->document = asset('public/images/employee/' . $document_name);
        }
        $employee_detail->save();
        BuildingAssignUser::create([
            'user_id' => $employee->id,
            'building_id' => $request->building_id,
        ]);