app/Http/Controllers/Property/InventoryController.php

    public function index()
    {
        $country = Country::all();
        $client_id = BuildingCustomer::where('property_admin_id', Helpers::user_admin())->get()->pluck('customer_id');
        $client = User::whereIn('id', $client_id)->get();
---
select * from `countries`
select * from `building_customers` where `property_admin_id` = 10
select * from `users` where `id` in (1) and `users`.`deleted_at` is null