app/Http/Controllers/Admin/PropertyAdminController.php

select * from `users` where `users`.`id` = '10' and `users`.`deleted_at` is null limit 1
---
    public function update(Request $request, $id)
    {
        $request->validate([
            'username' => 'required',
            'email' => 'required',
            'building' => 'required',
        ]);
        $property_admin = User::findOrFail($id);